#### [`custom-constructs`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/custom-constructs/runs/run-KkLm5LpWmUVzFdM2" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/custom-constructs/runs/run-KkLm5LpWmUVzFdM2

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...
data.github_repository.cdktf-construct-cdktf-multi-stack-tfe_repo_5BB71C62: Reading...
data.github_team.cdktf-team-cdktf: Reading...
data.github_repository.cdktf-construct-cdktf-local-exec_repo_64EDC49D: Reading...
data.github_repository.cdktf-construct-cdktf-cdk8s_repo_6A622B5E: Reading...
data.github_repository.cdktf-construct-cdktf-tf-module-stack_repo_1C630C5A: Reading...
github_repository.customconstructs_cdktftfmodulestackgo_repo_BD5C70DA: Refreshing state... [id=cdktf-tf-module-stack-go]
data.github_repository.cdktf-construct-cdktf-multi-stack-tfe_repo_5BB71C62: Read complete after 0s [id=cdktf-multi-stack-tfe]
github_issue_label.customconstructs_cdktfconstructcdktfmultistacktfe_repositorysetup_automergelabel_81A2BE1F: Refreshing state... [id=cdktf-multi-stack-tfe:automerge]
github_actions_secret.customconstructs_cdktfconstructcdktfmultistacktfe_repo_secretnpmtoken_53CDDEEA: Refreshing state... [id=cdktf-multi-stack-tfe:NPM_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktfmultistacktfe_repo_secretghtokenaliasGOGITHUBTOKEN_5FC8E998: Refreshing state... [id=cdktf-multi-stack-tfe:GO_GITHUB_TOKEN]
github_repository_webhook.customconstructs_cdktfconstructcdktfmultistacktfe_repositorysetup_slackwebhook_B53BE4E1: Refreshing state... [id=385811467]
github_actions_secret.customconstructs_cdktfconstructcdktfmultistacktfe_repo_secretghtokenaliasPROJENGITHUBTOKEN_26864905: Refreshing state... [id=cdktf-multi-stack-tfe:PROJEN_GITHUB_TOKEN]
data.github_repository.cdktf-construct-cdktf-cdk8s_repo_6A622B5E: Read complete after 0s [id=cdktf-cdk8s]
github_actions_secret.customconstructs_cdktfconstructcdktfmultistacktfe_repo_secrettwinepassword_4FFE9BE5: Refreshing state... [id=cdktf-multi-stack-tfe:TWINE_PASSWORD]
data.github_repository.cdktf-construct-cdktf-local-exec_repo_64EDC49D: Read complete after 0s [id=cdktf-local-exec]
github_actions_secret.customconstructs_cdktfconstructcdktfmultistacktfe_repo_secretghtoken_39B01FBC: Refreshing state... [id=cdktf-multi-stack-tfe:GH_TOKEN]
data.github_repository.cdktf-construct-cdktf-tf-module-stack_repo_1C630C5A: Read complete after 0s [id=cdktf-tf-module-stack]
github_actions_secret.customconstructs_cdktfconstructcdktfmultistacktfe_repo_secrettwineusername_EB85F0BF: Refreshing state... [id=cdktf-multi-stack-tfe:TWINE_USERNAME]
github_actions_secret.customconstructs_cdktfconstructcdktfcdk8s_repo_secretghtokenaliasPROJENGITHUBTOKEN_E3B90B5F: Refreshing state... [id=cdktf-cdk8s:PROJEN_GITHUB_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktfcdk8s_repo_secretghtokenaliasGOGITHUBTOKEN_685F1BFC: Refreshing state... [id=cdktf-cdk8s:GO_GITHUB_TOKEN]
github_repository_webhook.customconstructs_cdktfconstructcdktfcdk8s_repositorysetup_slackwebhook_5D29CDDD: Refreshing state... [id=385811429]
github_actions_secret.customconstructs_cdktfconstructcdktfcdk8s_repo_secretghtoken_15793D0C: Refreshing state... [id=cdktf-cdk8s:GH_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktfcdk8s_repo_secrettwinepassword_3EEB468D: Refreshing state... [id=cdktf-cdk8s:TWINE_PASSWORD]
github_actions_secret.customconstructs_cdktfconstructcdktfcdk8s_repo_secrettwineusername_2CE61A73: Refreshing state... [id=cdktf-cdk8s:TWINE_USERNAME]
github_actions_secret.customconstructs_cdktfconstructcdktfcdk8s_repo_secretnpmtoken_E84D4D40: Refreshing state... [id=cdktf-cdk8s:NPM_TOKEN]
github_issue_label.customconstructs_cdktfconstructcdktfcdk8s_repositorysetup_automergelabel_F24CD948: Refreshing state... [id=cdktf-cdk8s:automerge]
github_repository_webhook.customconstructs_cdktfconstructcdktflocalexec_repositorysetup_slackwebhook_AD39C2ED: Refreshing state... [id=385811432]
github_actions_secret.customconstructs_cdktfconstructcdktflocalexec_repo_secrettwinepassword_01F20187: Refreshing state... [id=cdktf-local-exec:TWINE_PASSWORD]
github_issue_label.customconstructs_cdktfconstructcdktflocalexec_repositorysetup_automergelabel_D60459FC: Refreshing state... [id=cdktf-local-exec:automerge]
github_actions_secret.customconstructs_cdktfconstructcdktflocalexec_repo_secretnpmtoken_C8A5F85E: Refreshing state... [id=cdktf-local-exec:NPM_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktflocalexec_repo_secretghtoken_74A03037: Refreshing state... [id=cdktf-local-exec:GH_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktflocalexec_repo_secretghtokenaliasPROJENGITHUBTOKEN_AAB6222D: Refreshing state... [id=cdktf-local-exec:PROJEN_GITHUB_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktflocalexec_repo_secrettwineusername_F630C71D: Refreshing state... [id=cdktf-local-exec:TWINE_USERNAME]
data.github_team.cdktf-team-cdktf: Read complete after 5s [id=6602018]
github_actions_secret.customconstructs_cdktfconstructcdktflocalexec_repo_secretghtokenaliasGOGITHUBTOKEN_CF3E4145: Refreshing state... [id=cdktf-local-exec:GO_GITHUB_TOKEN]
github_repository_webhook.customconstructs_cdktfconstructcdktftfmodulestack_repositorysetup_slackwebhook_62030303: Refreshing state... [id=385811493]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secrettwineusername_1ECAAABA: Refreshing state... [id=cdktf-tf-module-stack:TWINE_USERNAME]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretnugetapikey_784194A7: Refreshing state... [id=cdktf-tf-module-stack:NUGET_API_KEY]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secrettwinepassword_75B44DAA: Refreshing state... [id=cdktf-tf-module-stack:TWINE_PASSWORD]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretghtokenaliasPROJENGITHUBTOKEN_B560FB58: Refreshing state... [id=cdktf-tf-module-stack:PROJEN_GITHUB_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretmavenpassword_11FCA788: Refreshing state... [id=cdktf-tf-module-stack:MAVEN_PASSWORD]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretmavenusername_8940B1E6: Refreshing state... [id=cdktf-tf-module-stack:MAVEN_USERNAME]
github_issue_label.customconstructs_cdktfconstructcdktftfmodulestack_repositorysetup_automergelabel_9EDDC355: Refreshing state... [id=cdktf-tf-module-stack:automerge]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretmavenstagingprofileid_8A4652D8: Refreshing state... [id=cdktf-tf-module-stack:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretnpmtoken_DF590CDA: Refreshing state... [id=cdktf-tf-module-stack:NPM_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretmavengpgprivatekey_C5913362: Refreshing state... [id=cdktf-tf-module-stack:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretghtoken_0F81B431: Refreshing state... [id=cdktf-tf-module-stack:GH_TOKEN]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretmavengpgprivatekeypassphrase_809F3B9E: Refreshing state... [id=cdktf-tf-module-stack:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.customconstructs_cdktfconstructcdktftfmodulestack_repo_secretghtokenaliasGOGITHUBTOKEN_E2D82A8A: Refreshing state... [id=cdktf-tf-module-stack:GO_GITHUB_TOKEN]
github_repository_webhook.customconstructs_cdktftfmodulestackgo_repositorysetup_slackwebhook_D78F089C: Refreshing state... [id=387516719]
github_issue_label.customconstructs_cdktftfmodulestackgo_repositorysetup_automergelabel_EDE5B73D: Refreshing state... [id=cdktf-tf-module-stack-go:automerge]
github_team_repository.customconstructs_cdktfconstructcdktfmultistacktfe_repositorysetup_managingteam_6C6E991B: Refreshing state... [id=6602018:cdktf-multi-stack-tfe]
github_team_repository.customconstructs_cdktftfmodulestackgo_repositorysetup_managingteam_DA3227CE: Refreshing state... [id=6602018:cdktf-tf-module-stack-go]
github_team_repository.customconstructs_cdktfconstructcdktflocalexec_repositorysetup_managingteam_53495EFB: Refreshing state... [id=6602018:cdktf-local-exec]
github_team_repository.customconstructs_cdktfconstructcdktfcdk8s_repositorysetup_managingteam_422237F2: Refreshing state... [id=6602018:cdktf-cdk8s]
github_team_repository.customconstructs_cdktfconstructcdktftfmodulestack_repositorysetup_managingteam_482F7B63: Refreshing state... [id=6602018:cdktf-tf-module-stack]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.customconstructs_cdktfconstructcdktfcdk8s_repositorysetup_mainprotection_6CA6CB28 will be created
  + resource "github_branch_protection" "customconstructs_cdktfconstructcdktfcdk8s_repositorysetup_mainprotection_6CA6CB28" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-cdk8s"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "license/cla",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.customconstructs_cdktfconstructcdktflocalexec_repositorysetup_mainprotection_51B01491 will be created
  + resource "github_branch_protection" "customconstructs_cdktfconstructcdktflocalexec_repositorysetup_mainprotection_51B01491" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-local-exec"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "license/cla",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.customconstructs_cdktfconstructcdktfmultistacktfe_repositorysetup_mainprotection_670F3B5C will be created
  + resource "github_branch_protection" "customconstructs_cdktfconstructcdktfmultistacktfe_repositorysetup_mainprotection_670F3B5C" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-multi-stack-tfe"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "license/cla",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.customconstructs_cdktfconstructcdktftfmodulestack_repositorysetup_mainprotection_93BDF510 will be created
  + resource "github_branch_protection" "customconstructs_cdktfconstructcdktftfmodulestack_repositorysetup_mainprotection_93BDF510" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-tf-module-stack"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "license/cla",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_issue_label.cdktf-construct-cdktf-cdk8s_repository-setup_auto-approve-label_46AAE156 will be created
  + resource "github_issue_label" "cdktf-construct-cdktf-cdk8s_repository-setup_auto-approve-label_46AAE156" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-cdk8s"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-construct-cdktf-local-exec_repository-setup_auto-approve-label_58C7EDEC will be created
  + resource "github_issue_label" "cdktf-construct-cdktf-local-exec_repository-setup_auto-approve-label_58C7EDEC" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-local-exec"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-construct-cdktf-multi-stack-tfe_repository-setup_auto-approve-label_C36794CF will be created
  + resource "github_issue_label" "cdktf-construct-cdktf-multi-stack-tfe_repository-setup_auto-approve-label_C36794CF" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-multi-stack-tfe"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-construct-cdktf-tf-module-stack_repository-setup_auto-approve-label_5CF06293 will be created
  + resource "github_issue_label" "cdktf-construct-cdktf-tf-module-stack_repository-setup_auto-approve-label_5CF06293" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-tf-module-stack"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-tf-module-stack-go_repository-setup_auto-approve-label_29FEBEFF will be created
  + resource "github_issue_label" "cdktf-tf-module-stack-go_repository-setup_auto-approve-label_29FEBEFF" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-tf-module-stack-go"
      + url        = (known after apply)
    }

  # github_repository.customconstructs_cdktftfmodulestackgo_repo_BD5C70DA will be updated in-place
  ~ resource "github_repository" "customconstructs_cdktftfmodulestackgo_repo_BD5C70DA" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-tf-module-stack-go"
        name                        = "cdktf-tf-module-stack-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "alert-prs-slack-webhook-url" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-KkLm5LpWmUVzFdM2/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*